org/manual.org
#+title: Clasp Manual
#+OPTIONS: ^:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/><script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script><script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script><script type="text/javascript" src="styles/lib/js/jquery.stickytableheaders.min.js"></script><script type="text/javascript" src="styles/readtheorg/js/readtheorg.js"></script>

* Introduction

Clasp is an implementation of Common Lisp primarily designed for compatibility with C++-language programs and libraries.

Note that Clasp is a work in progress, as is this manual.

** Conformance

Clasp conforms with the requirements of ANSI INCITS 226-1994 (R2004) with some exceptions, listed below in the "Lisp" section. Any deviation from the standard not listed there is a bug, and should be reported (see "Contributing").

** Distribution

At present, the developers do not make Clasp binaries available. Clasp is open source, and available on-line at https://github.com/clasp-developers/clasp.

** Building

See [[file:building.org][Building]].

** Contributing

Check [[file:community.org][the community page]] for instructions on contributing to Clasp.

Discussions of Clasp development are mostly carried out on Freenode's #clasp channel.

** Credits

Clasp is the project of [[https://thirdlaw.tech][Dr. Christian Schafmeister]]. Additional contributions have been made by [[https://github.com/yitzchak][Tarn W. Burton]], [[https://github.com/kpoeck][Karsten Poeck]], [[https://github.com/Bike][Alex Wood]], and many other contributors as seen in the Git history.

Clasp's source code is derived substantially from that of Embeddable Common Lisp. Code from SBCL and SICL has been incorporated as well. Most notably, the compiler is SICL's Cleavir compiler with some minor customizations.

* Starting and Stopping

The Clasp executable accepts many different command line arguments. You can get the most up to date summary by passing =--help=. Here are some important ones:

- =--noinform=: Skip messages at startup.
- =--noprint=: Start a read-eval loop instead of a read-eval-print loop, and don't prompt. This is intended for scripts (e.g. piping a list of forms to Clasp).
- =--disable-debugger=: Set things up so that if the default debugger would be entered, Clasp quits with a backtrace and nonzero exit status instead. =*debugger-hook*= and =ext:*invoke-debugger-hook*= (below) work as usual, i.e. this setting does not affect them.
- =--non-interactive=: Rather than starting a REPL, quit. This is intended to be used with =--eval= and =--load=. Implies =--disable-debugger=.
- =--feature feature=: Intern "feature" as a keyword and push it to =*features*=.
- =--eval form=: Evaluate the given form. =--eval= and =--load= options are processed in order from left to right.
- =--load filename=: =cl:load= the given file. Intended for convenience, since =--eval (load ...)= could involve annoying quotation issues.
- =--norc=: Do not load =~/.clasprc= (see below).

If the file =~/.clasprc= exists, Clasp will =cl:load= it before processing =--eval= and =--load= options and starting the REPL.

To exit Clasp, the =ext:quit= function can be used. If provided an integer argument, it's used as the exit status; the default is zero.

* Lisp

Clasp is an implementation of [[https://en.wikipedia.org/wiki/Common_Lisp][ANSI Common Lisp]]. The following subsections detail intentional deviations from the standard,
some extensions to standard functionality,
and notes on optimizing Lisp programs to run well within Clasp.
(Extensions not closely related to standard systems are explained in their own sections below.)

** Evaluation and Compilation

Clasp expands compiler macros essentially unconditionally.
That is, provided the operator is not declared =notinline=,
the compiler will attempt to expand compiler macros.
If compiler macroexpansion signals, this signal will be recorded and reported by the compiler.
If compiler macroexpansion errors out, the compiler will abandon expansion and use the unexpanded form,
while noting the error for display.

=ext:with-current-source-form= is a useful macro to allow error messages from macroexpanders and compiler-macro-expanders to have more specific source information. See its docstring for more information.

# We have a symbol macro function accessor, but I don't think it will work for non-global symbol macros, so it can't exactly be documented right now.

