manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-24 Fri 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clasp Manual</title>
<meta name="author" content="Alex Wood" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="preamble" class="status">
<div id="top-menu">
<ul>
<li><a href="index.html">Clasp</a>
<ul>
<li><a href="news.html">News</a></li>
<li><a href="download.html">Download</a></li>
</ul></li>
<li><a href="index.html">Doc</a>
<ul>
<li><a href="license.html">License</a></li>
<li><a href="manual.html">Manual</a></li>
<li><a href="building.html">Building</a></li>
<li><a href="clbind-doc.html">Exposing C++ Libraries</a></li>
</ul></li>
<li><a href="index.html">Misc</a>
<ul>
<li><a href="community.html">Community</a></li>
<li><a href="projects.html">Projects</a></li>
<li><a href="media.html">Media</a></li>
<li><a href="acknowlegements.html">Acknowledgements</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="content" class="content">
<h1 class="title">Clasp Manual</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga0c7d20">1. Introduction</a>
<ul>
<li><a href="#org7c305c3">1.1. Conformance</a></li>
<li><a href="#org0593848">1.2. Distribution</a></li>
<li><a href="#org5f8a7df">1.3. Building</a></li>
<li><a href="#org0da5b65">1.4. Contributing</a></li>
<li><a href="#org02aec25">1.5. Credits</a></li>
</ul>
</li>
<li><a href="#org0ec8abd">2. Starting and Stopping</a></li>
<li><a href="#orgf48f546">3. Lisp</a>
<ul>
<li><a href="#org9a8293c">3.1. Evaluation and Compilation</a></li>
<li><a href="#orga6c469d">3.2. Types and Classes</a>
<ul>
<li><a href="#org07246e6">3.2.1. Disjointness</a></li>
</ul>
</li>
<li><a href="#org45a45ad">3.3. Data and Control Flow</a></li>
<li><a href="#org36b0865">3.4. Iteration</a></li>
<li><a href="#org19cc97d">3.5. Objects</a>
<ul>
<li><a href="#orgb9e9d39">3.5.1. Metaobject Protocol</a></li>
<li><a href="#org7da3acf">3.5.2. Generic function dispatch efficiency</a></li>
<li><a href="#org6157fe5">3.5.3. Miscellany</a></li>
</ul>
</li>
<li><a href="#org317aaa9">3.6. Structures</a></li>
<li><a href="#orgb8aabdd">3.7. Conditions</a></li>
<li><a href="#orgff59aab">3.8. Symbols</a></li>
<li><a href="#org05f0493">3.9. Packages</a></li>
<li><a href="#orga015640">3.10. Numbers</a></li>
<li><a href="#orgca58f61">3.11. Characters</a></li>
<li><a href="#orgf8619f3">3.12. Conses</a></li>
<li><a href="#org39ae6b2">3.13. Arrays</a></li>
<li><a href="#org0ffaa93">3.14. Strings</a></li>
<li><a href="#orgc2fdf12">3.15. Sequences</a>
<ul>
<li><a href="#org2083348">3.15.1. Extensible Sequences</a></li>
</ul>
</li>
<li><a href="#org808c9e2">3.16. Hash Tables</a></li>
<li><a href="#org8cebe85">3.17. Filenames</a></li>
<li><a href="#org8b2f91f">3.18. Files</a></li>
<li><a href="#org26ac30a">3.19. Streams</a>
<ul>
<li><a href="#org1684136">3.19.1. Gray streams</a></li>
</ul>
</li>
<li><a href="#orgba02f72">3.20. Printer</a></li>
<li><a href="#org85f13e0">3.21. Reader</a></li>
<li><a href="#org563ce55">3.22. System Construction</a></li>
<li><a href="#org38f1fea">3.23. Environment</a>
<ul>
<li><a href="#orgc61246d">3.23.1. Stepper</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbc21741">4. C++ Interface (clbind)</a></li>
<li><a href="#orga5b38bd">5. Foreign Function Interface</a></li>
<li><a href="#orgda813fc">6. REPL</a></li>
<li><a href="#orge670187">7. Debug interface</a></li>
<li><a href="#org8b07d65">8. Multiprocessing</a>
<ul>
<li><a href="#org3c00ed3">8.1. Processes</a></li>
<li><a href="#org70e328d">8.2. Special variables</a></li>
<li><a href="#org69b788b">8.3. Mutexes</a></li>
<li><a href="#org421abb5">8.4. Shared Mutexes</a></li>
<li><a href="#org48cab55">8.5. Condition Variables</a></li>
<li><a href="#org73a5092">8.6. Memory Model</a></li>
<li><a href="#org87b49c6">8.7. Atomics</a></li>
<li><a href="#orgea21694">8.8. Compare-and-swap</a></li>
<li><a href="#org7d1123e">8.9. Fences</a></li>
</ul>
</li>
<li><a href="#org6c1467a">9. Introspection</a></li>
<li><a href="#org0593e63">10. Sockets</a></li>
<li><a href="#orgdd77ef0">11. Serve Event</a></li>
<li><a href="#orgab7bd5a">12. Garbage Collection</a></li>
<li><a href="#orgf2544ea">13. POSIX</a>
<ul>
<li><a href="#orga2d7c52">13.1. Signal Handling</a></li>
<li><a href="#org851b419">13.2. Further posix interfaces</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga0c7d20" class="outline-2">
<h2 id="orga0c7d20"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Clasp is an implementation of Common Lisp primarily designed for compatibility with C++-language programs and libraries.
</p>

<p>
Note that Clasp is a work in progress, as is this manual.
</p>
</div>

<div id="outline-container-org7c305c3" class="outline-3">
<h3 id="org7c305c3"><span class="section-number-3">1.1.</span> Conformance</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Clasp conforms with the requirements of ANSI INCITS 226-1994 (R2004) with some exceptions, listed below in the "Lisp" section. Any deviation from the standard not listed there is a bug, and should be reported (see "Contributing").
</p>
</div>
</div>

<div id="outline-container-org0593848" class="outline-3">
<h3 id="org0593848"><span class="section-number-3">1.2.</span> Distribution</h3>
<div class="outline-text-3" id="text-1-2">
<p>
At present, the developers do not make Clasp binaries available. Clasp is open source, and available on-line at <a href="https://github.com/clasp-developers/clasp">https://github.com/clasp-developers/clasp</a>.
</p>
</div>
</div>

<div id="outline-container-org5f8a7df" class="outline-3">
<h3 id="org5f8a7df"><span class="section-number-3">1.3.</span> Building</h3>
<div class="outline-text-3" id="text-1-3">
<p>
See <a href="building.html">Building</a>.
</p>
</div>
</div>

<div id="outline-container-org0da5b65" class="outline-3">
<h3 id="org0da5b65"><span class="section-number-3">1.4.</span> Contributing</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Check <a href="community.html">the community page</a> for instructions on contributing to Clasp.
</p>

<p>
Discussions of Clasp development are mostly carried out on Freenode's #clasp channel.
</p>
</div>
</div>

<div id="outline-container-org02aec25" class="outline-3">
<h3 id="org02aec25"><span class="section-number-3">1.5.</span> Credits</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Clasp is the project of <a href="https://thirdlaw.tech">Dr. Christian Schafmeister</a>. Additional contributions have been made by <a href="https://github.com/yitzchak">Tarn W. Burton</a>, <a href="https://github.com/kpoeck">Karsten Poeck</a>, <a href="https://github.com/Bike">Alex Wood</a>, and many other contributors as seen in the Git history.
</p>

<p>
Clasp's source code is derived substantially from that of Embeddable Common Lisp. Code from SBCL and SICL has been incorporated as well. Most notably, the compiler is SICL's Cleavir compiler with some minor customizations.
</p>
</div>
</div>
</div>

<div id="outline-container-org0ec8abd" class="outline-2">
<h2 id="org0ec8abd"><span class="section-number-2">2.</span> Starting and Stopping</h2>
<div class="outline-text-2" id="text-2">
<p>
The Clasp executable accepts many different command line arguments. You can get the most up to date summary by passing <code>--help</code>. Here are some important ones:
</p>

<ul class="org-ul">
<li><code>--noinform</code>: Skip messages at startup.</li>
<li><code>--noprint</code>: Start a read-eval loop instead of a read-eval-print loop, and don't prompt. This is intended for scripts (e.g. piping a list of forms to Clasp).</li>
<li><code>--disable-debugger</code>: Set things up so that if the default debugger would be entered, Clasp quits with a backtrace and nonzero exit status instead. <code>*debugger-hook*</code> and <code>ext:*invoke-debugger-hook*</code> (below) work as usual, i.e. this setting does not affect them.</li>
<li><code>--non-interactive</code>: Rather than starting a REPL, quit. This is intended to be used with <code>--eval</code> and <code>--load</code>. Implies <code>--disable-debugger</code>.</li>
<li><code>--feature feature</code>: Intern "feature" as a keyword and push it to <code>*features*</code>.</li>
<li><code>--eval form</code>: Evaluate the given form. <code>--eval</code> and <code>--load</code> options are processed in order from left to right.</li>
<li><code>--load filename</code>: <code>cl:load</code> the given file. Intended for convenience, since <code>--eval (load ...)</code> could involve annoying quotation issues.</li>
<li><code>--norc</code>: Do not load <code>~/.clasprc</code> (see below).</li>
</ul>

<p>
If the file <code>~/.clasprc</code> exists, Clasp will <code>cl:load</code> it before processing <code>--eval</code> and <code>--load</code> options and starting the REPL.
</p>

<p>
To exit Clasp, the <code>ext:quit</code> function can be used. If provided an integer argument, it's used as the exit status; the default is zero.
</p>
</div>
</div>

<div id="outline-container-orgf48f546" class="outline-2">
<h2 id="orgf48f546"><span class="section-number-2">3.</span> Lisp</h2>
<div class="outline-text-2" id="text-3">
<p>
Clasp is an implementation of <a href="https://en.wikipedia.org/wiki/Common_Lisp">ANSI Common Lisp</a>. The following subsections detail intentional deviations from the standard,
some extensions to standard functionality,
and notes on optimizing Lisp programs to run well within Clasp.
(Extensions not closely related to standard systems are explained in their own sections below.)
</p>
</div>

<div id="outline-container-org9a8293c" class="outline-3">
<h3 id="org9a8293c"><span class="section-number-3">3.1.</span> Evaluation and Compilation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Clasp expands compiler macros essentially unconditionally.
That is, provided the operator is not declared <code>notinline</code>,
the compiler will attempt to expand compiler macros.
If compiler macroexpansion signals, this signal will be recorded and reported by the compiler.
If compiler macroexpansion errors out, the compiler will abandon expansion and use the unexpanded form,
while noting the error for display.
</p>

<p>
<code>ext:with-current-source-form</code> is a useful macro to allow error messages from macroexpanders and compiler-macro-expanders to have more specific source information. See its docstring for more information.
</p>
</div>
</div>
