org/manual.org
** Types and Classes

=typep= calls can be efficiently compiled only if the second argument, the type specifier, is constant.
Clasp's compiler will process the type specifier and generate code to check for objects of that type
directly, avoiding the usual runtime cost of interpreting the type.

Types defined by =deftype= use a "type expander" function analogous to a macro expander function.
A type expander is a function of two arguments, a type specifier and an environment. When called on an appropriate specifier and environment, it computes and returns another type specifier. Type expanders are accessible through the =ext:type-expander= accessor.

*** Disjointness

Unless otherwise specified, types Clasp defines as extensions can be considered to be in a disjointness
relationship with standard and other extension types, as in CLHS 4.2.2 "Type Relationships".
That is, if Clasp defines a type =foo=, you can assume that =foo= is not a subtype of =hash-table=,
or =cons=, or so on, and vice versa, unless it is explicitly stated to be.
But just as in 4.2.2, Clasp extension types may be subtypes of =structure-object= or =standard-object=
without this being explicitly noted here.

** Data and Control Flow

# specialp and symbol-constantp aren't really regular enough to document

# core:out-of-extent-unwind should perhaps be moved to ext

=defsetf=, =define-setf-expander= etc. define a "setf expander" function analogous to a macro expander
function. A setf expander is a function of two arguments, a place and an environment.
When called an appropriate place and environment, the expander computes and returns the values used by
=setf=. Setf expanders are accessible through the =ext:setf-expander= accessor.

** Iteration

=loop= supports iteration over general sequences (see below) through a for-as-sequence subclause.
This is identical to the subclause in SBCL.
The syntax is =being {each | the} {element | elements} {of | in}=.
For example, =(loop for x being each element in '(1 2 3) do (print x))=.

** Objects

CLOS, as part of Common Lisp, is fully supported.

*** Metaobject Protocol

The Metaobject Protocol, as described in [[http://metamodular.com/CLOS-MOP/][AMOP]], is supported.
Undocumented deviations from AMOP are bugs and should be reported, as with the CL standard.

Symbols relating to MOP are exported from the "CLOS" package.

*** Generic function dispatch efficiency

Clasp uses a new system for generic function dispatch designed by Dr. Robert Strandh.
[Paper reference goes here.] Essentially, after a few calls to a generic function,
a just-in-time compiler will install a discriminating function for it that can pass control to the
correct effective method very efficiently. This means that calls with arguments that all have the same
specializers as those of a previous call will in general be more efficient.

For some applications, the specializers a function will be called with are known beforehand,
and the runtime overhead of the just-in-time compilation would be unfortunate.
Clasp defines an interface to take care of most of the compilation early: The =clos:satiate= function.
See its docstring for more info.

*** Miscellany

A consequence of the dispatch method described above is that obsolete instances are updated as soon as
they are used as an argument to any generic function call - not just to slot accessors.
This is allowed by the standard, but may surprise some programmers.

** Structures

** Conditions

In addition to =cl:restart-name=, Clasp provides some readers to introspect about restarts,
for advanced users (e.g. writing your own debugger, or the [[https://github.com/Shinmera/dissect][Dissect]] library):
=ext:restart-function= returns the function called by =cl:invoke-restart=, and =ext:report-function=,
=ext:interactive-function=, and =ext:interactive-function= return the corresponding arguments in
=cl:restart-bind=. These will always be appropriate functions, so for example =ext:report-function= will
always return a function of one stream argument, but if no =:report-function= was provided it will report
the restart in Clasp's default way. The identities of these returned functions cannot be relied on,
i.e. they may not be identical to those provided to =cl:restart-bind=.

There is also =ext:restart-associated-conditions=, which returns a list of conditions associated
(by =cl:with-condition-restarts=) with the restart in the current dynamic environment.

** Symbols

** Packages

Clasp supports package-local nicknames, through an interface based on that of SBCL's.
A package-local nickname is a nickname for a package that is only active when some other package is in
place as =*package*=. For example, if the package "FOO" has "B" as a package-local nickname for package
"BAR", then while =*package*= is the =foo= package, the prefix "B:" will be read as if it was "BAR:".

Local nicknames may be specified in =defpackage= through the =(:local-nicknames (nickname package-name)*)=
extended options. =nickname= must be a string designator and =package-name= a package designator - both
are unevaluated. The functions =ext:package-local-nicknames=, =ext:add-package-local-nickname=,
=ext:remove-package-local-nickname=, and =ext:package-locally-nicknamed-by-list= can be used for a more
programmatic interface.

** Numbers

There are two types of floats, =single-float= and =double-float=. =short-float= is synonymous with the
former and =long-float= is synonymous with the latter, per the standard's requirements.
=single-float= is in the IEEE754 binary32 (single) format, and =double-float= in binary64 (double) format.
The representation of a float as bits can be interconverted with a float using the functions
=ext:single-float-to-bits=, =bits-to-single-float=, =double-float-to-bits=, and =bits-to-double-float=.
These functions take or return nonnegative integers;
for example =(logbitp 31 (ext:single-floats-to-bit float))= returns whether the sign bit is set.

** Characters

Clasp supports Unicode by default. =code-char= and =char-code= work with Unicode codepoints.
Unicode character names are also supported, e.g. =(princ #\GREEK_SMALL_LETTER_LAMDA) -> λ=.
=(defun λ(n)(* 2 n)) (λ 32) -> 64=is also possible.

Type =character= includes all characters in Unicode. Type =base-char= includes only single byte
characters, i.e. Basic Latin and Latin-1 Supplement.

** Conses

