manual.html

<div id="outline-container-orga6c469d" class="outline-3">
<h3 id="orga6c469d"><span class="section-number-3">3.2.</span> Types and Classes</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>typep</code> calls can be efficiently compiled only if the second argument, the type specifier, is constant.
Clasp's compiler will process the type specifier and generate code to check for objects of that type
directly, avoiding the usual runtime cost of interpreting the type.
</p>

<p>
Types defined by <code>deftype</code> use a "type expander" function analogous to a macro expander function.
A type expander is a function of two arguments, a type specifier and an environment. When called on an appropriate specifier and environment, it computes and returns another type specifier. Type expanders are accessible through the <code>ext:type-expander</code> accessor.
</p>
</div>

<div id="outline-container-org07246e6" class="outline-4">
<h4 id="org07246e6"><span class="section-number-4">3.2.1.</span> Disjointness</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Unless otherwise specified, types Clasp defines as extensions can be considered to be in a disjointness
relationship with standard and other extension types, as in CLHS 4.2.2 "Type Relationships".
That is, if Clasp defines a type <code>foo</code>, you can assume that <code>foo</code> is not a subtype of <code>hash-table</code>,
or <code>cons</code>, or so on, and vice versa, unless it is explicitly stated to be.
But just as in 4.2.2, Clasp extension types may be subtypes of <code>structure-object</code> or <code>standard-object</code>
without this being explicitly noted here.
</p>
</div>
</div>
</div>

<div id="outline-container-org45a45ad" class="outline-3">
<h3 id="org45a45ad"><span class="section-number-3">3.3.</span> Data and Control Flow</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<code>defsetf</code>, <code>define-setf-expander</code> etc. define a "setf expander" function analogous to a macro expander
function. A setf expander is a function of two arguments, a place and an environment.
When called an appropriate place and environment, the expander computes and returns the values used by
<code>setf</code>. Setf expanders are accessible through the <code>ext:setf-expander</code> accessor.
</p>
</div>
</div>

<div id="outline-container-org36b0865" class="outline-3">
<h3 id="org36b0865"><span class="section-number-3">3.4.</span> Iteration</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<code>loop</code> supports iteration over general sequences (see below) through a for-as-sequence subclause.
This is identical to the subclause in SBCL.
The syntax is <code>being {each | the} {element | elements} {of | in}</code>.
For example, <code>(loop for x being each element in '(1 2 3) do (print x))</code>.
</p>
</div>
</div>

<div id="outline-container-org19cc97d" class="outline-3">
<h3 id="org19cc97d"><span class="section-number-3">3.5.</span> Objects</h3>
<div class="outline-text-3" id="text-3-5">
<p>
CLOS, as part of Common Lisp, is fully supported.
</p>
</div>

<div id="outline-container-orgb9e9d39" class="outline-4">
<h4 id="orgb9e9d39"><span class="section-number-4">3.5.1.</span> Metaobject Protocol</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
The Metaobject Protocol, as described in <a href="http://metamodular.com/CLOS-MOP/">AMOP</a>, is supported.
Undocumented deviations from AMOP are bugs and should be reported, as with the CL standard.
</p>

<p>
Symbols relating to MOP are exported from the "CLOS" package.
</p>
</div>
</div>

<div id="outline-container-org7da3acf" class="outline-4">
<h4 id="org7da3acf"><span class="section-number-4">3.5.2.</span> Generic function dispatch efficiency</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
Clasp uses a new system for generic function dispatch designed by Dr. Robert Strandh.
[Paper reference goes here.] Essentially, after a few calls to a generic function,
a just-in-time compiler will install a discriminating function for it that can pass control to the
correct effective method very efficiently. This means that calls with arguments that all have the same
specializers as those of a previous call will in general be more efficient.
</p>

<p>
For some applications, the specializers a function will be called with are known beforehand,
and the runtime overhead of the just-in-time compilation would be unfortunate.
Clasp defines an interface to take care of most of the compilation early: The <code>clos:satiate</code> function.
See its docstring for more info.
</p>
</div>
</div>

<div id="outline-container-org6157fe5" class="outline-4">
<h4 id="org6157fe5"><span class="section-number-4">3.5.3.</span> Miscellany</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
A consequence of the dispatch method described above is that obsolete instances are updated as soon as
they are used as an argument to any generic function call - not just to slot accessors.
This is allowed by the standard, but may surprise some programmers.
</p>
</div>
</div>
</div>

<div id="outline-container-org317aaa9" class="outline-3">
<h3 id="org317aaa9"><span class="section-number-3">3.6.</span> Structures</h3>
</div>

<div id="outline-container-orgb8aabdd" class="outline-3">
<h3 id="orgb8aabdd"><span class="section-number-3">3.7.</span> Conditions</h3>
<div class="outline-text-3" id="text-3-7">
<p>
In addition to <code>cl:restart-name</code>, Clasp provides some readers to introspect about restarts,
for advanced users (e.g. writing your own debugger, or the <a href="https://github.com/Shinmera/dissect">Dissect</a> library):
<code>ext:restart-function</code> returns the function called by <code>cl:invoke-restart</code>, and <code>ext:report-function</code>,
<code>ext:interactive-function</code>, and <code>ext:interactive-function</code> return the corresponding arguments in
<code>cl:restart-bind</code>. These will always be appropriate functions, so for example <code>ext:report-function</code> will
always return a function of one stream argument, but if no <code>:report-function</code> was provided it will report
the restart in Clasp's default way. The identities of these returned functions cannot be relied on,
i.e. they may not be identical to those provided to <code>cl:restart-bind</code>.
</p>

<p>
There is also <code>ext:restart-associated-conditions</code>, which returns a list of conditions associated
(by <code>cl:with-condition-restarts</code>) with the restart in the current dynamic environment.
</p>
</div>
</div>

<div id="outline-container-orgff59aab" class="outline-3">
<h3 id="orgff59aab"><span class="section-number-3">3.8.</span> Symbols</h3>
</div>

<div id="outline-container-org05f0493" class="outline-3">
<h3 id="org05f0493"><span class="section-number-3">3.9.</span> Packages</h3>
<div class="outline-text-3" id="text-3-9">
<p>
Clasp supports package-local nicknames, through an interface based on that of SBCL's.
A package-local nickname is a nickname for a package that is only active when some other package is in
place as <code>*package*</code>. For example, if the package "FOO" has "B" as a package-local nickname for package
"BAR", then while <code>*package*</code> is the <code>foo</code> package, the prefix "B:" will be read as if it was "BAR:".
</p>

<p>
Local nicknames may be specified in <code>defpackage</code> through the <code>(:local-nicknames (nickname package-name)*)</code>
extended options. <code>nickname</code> must be a string designator and <code>package-name</code> a package designator - both
are unevaluated. The functions <code>ext:package-local-nicknames</code>, <code>ext:add-package-local-nickname</code>,
<code>ext:remove-package-local-nickname</code>, and <code>ext:package-locally-nicknamed-by-list</code> can be used for a more
programmatic interface.
</p>
</div>
</div>

<div id="outline-container-orga015640" class="outline-3">
<h3 id="orga015640"><span class="section-number-3">3.10.</span> Numbers</h3>
<div class="outline-text-3" id="text-3-10">
<p>
There are two types of floats, <code>single-float</code> and <code>double-float</code>. <code>short-float</code> is synonymous with the
former and <code>long-float</code> is synonymous with the latter, per the standard's requirements.
<code>single-float</code> is in the IEEE754 binary32 (single) format, and <code>double-float</code> in binary64 (double) format.
The representation of a float as bits can be interconverted with a float using the functions
<code>ext:single-float-to-bits</code>, <code>bits-to-single-float</code>, <code>double-float-to-bits</code>, and <code>bits-to-double-float</code>.
These functions take or return nonnegative integers;
for example <code>(logbitp 31 (ext:single-floats-to-bit float))</code> returns whether the sign bit is set.
</p>
</div>
</div>

<div id="outline-container-orgca58f61" class="outline-3">
<h3 id="orgca58f61"><span class="section-number-3">3.11.</span> Characters</h3>
<div class="outline-text-3" id="text-3-11">
<p>
Clasp supports Unicode by default. <code>code-char</code> and <code>char-code</code> work with Unicode codepoints.
Unicode character names are also supported, e.g. <code>(princ #\GREEK_SMALL_LETTER_LAMDA) -&gt; λ</code>.
=(defun λ(n)(* 2 n)) (λ 32) -&gt; 64=is also possible.
</p>

<p>
Type <code>character</code> includes all characters in Unicode. Type <code>base-char</code> includes only single byte
characters, i.e. Basic Latin and Latin-1 Supplement.
</p>
</div>
</div>
