org/manual.org
** Arrays

In Clasp, arrays with no fill-pointer, displacement, or express adjustability are simple
(as in =simple-array=), and arrays that have any of these are not.
Additionally, Clasp implements multidimensional arrays - even ones that are simple in this sense - as
if they were displaced to an underlying one dimensional array.
As such, it is most efficient to work with one-dimensional simple arrays directly.

** Strings

** Sequences

*** Extensible Sequences

[[https://doi.org/10.1145/1622123.1622138][The extensible sequences protocol developed by Christophe Rhodes]] is supported.
Symbols related to the protocol are external in Clasp's "SEQUENCE" package.
This protocol allows programmers to define their own sequence classes that work efficiently with standard
Common Lisp functions. It is recommended that programmers consult other resources,
such as Dr. Rhodes' paper, for more information on how to use this protocol effectively.

To summarize: Programmers wishing to make a custom sequence class must ensure their class has
=cl:sequence= as a superclass. (Note that =sequence= is itself abstract, so if a custom class needs to
have e.g. slots, it should also be a subclass of =standard-object= or something like it.)
Methods on =elt=, =(setf elt)=, =length= applicable to objects of the class must be defined for any
sequence functions to work; an applicable method on =make-sequence-like= must be defined for creation
of this sequence to work; and an applicable method on =adjust-sequence= must be defined for destructive
operations to work. Standard sequence functions will then operate correctly with these sequences,
as will =make-sequence= and =coerce=.

For efficiency, programmers may also define applicable methods on =make-sequence-iterator=,
or less efficiently but more simply, on =make-simple-sequence-iterator=, =iterator-step=, =iterator-endp=,
=iterator-element=, =(setf iterator-element)=, =iterator-index=, and =iterator-copy=.

Note that because the =sequence:= generic function cognates to =cl:= sequence functions are defined to
have the same behavior in almost all cases, Clasp takes the view that they need not be called.
For example, a call to =cl:find= with a custom sequence object _may_ result in a call to =sequence:find=,
but may not. In other words the cognates are considered optional, and only possibly useful for
optimization. This is still in flux. If you think it's a bad idea, contact a maintainer to talk.

As a small extension to the extension, if a custom sequence object does not implement enough of the
protocol for a sequence function to complete, it will signal an error of type
=sequence:protocol-unimplemented=. The reader =sequence:protocol-unimplemented-operation= can be used to
get the name of the operation that failed from these conditions.

** Hash Tables

=make-hash-table= supports additional keyword arguments.

=:weakness= can be used to indicate that the garbage collection may collect individual hash table entries
even when the hash table itself is live, in certain circumstances. At present, only weak-key hash tables
are supported: when the weakness argument is =:key=, the hash table's reference to the key of a table
entry is _weak_, and if there are no non-weak references to a key, it is collectable.
See the "Garbage Collection" section below for more information on weak references.
If the weakness parameter is passed as =nil=, or not passed, the hash table does not contain weak references.

=:thread-safe= can be used to make hash table access safe across multiple threads.
If a thread-safe argument is not passed, or =nil= is passed, the hash table cannot safely be written to
or read from multiple threads simultaneously (see "Memory Model", below, for a brief explanation of
terminology). If the thread-safe argument is true, the implementation will ensure that accesses can be
carried out from multiple threads simultaneously safely. This does impose a small performance penalty,
which is why it is not the default.

If a =:test= other than a standard equality predicate is passed, =:hash-function= must be specified as
well. The hash function should be a designator for a function of one argument that is analogous to
=sxhash=, i.e. =(funcall test x y)= implies =(= (funcall hash-function x) (funcall hash-function y))=
and so on. This will create a "custom" hash table that can be used with the standard hash table functions
like =gethash=, with the exception that at the moment, attempting to dump a custom hash table has
undefined consequences.

** Filenames

** Files

=ext:rmdir= deletes a directory. =EXT:RMTREE= deletes an entire directory tree.

** Streams

*** Gray streams

The Gray stream interface as described in ANSI committee issue "STREAM-DEFINITION-BY-USER"
(readable, e.g., [[http://www.nhplace.com/kent/CL/Issues/stream-definition-by-user.html][on Kent Pitman's website]]) is supported. Symbols are exported from package "GRAY".
We recommend programmers use a multi-implementation compatibility layer such as [[https://common-lisp.net/project/trivial-gray-streams/][trivial-gray-streams]]
rather than use Clasp's implementation directly.

Gray streams allow programmers to define their own stream classes with custom behavior that work with
standard Common Lisp functions. It is recommended that programmers consult another resource, such as the
trivial-gray-streams documentation, for more information on how to use this interface effectively.

** Printer

When =format='s control string argument is constant, the compiler will process it early, so that the
runtime doesn't have to. This improves runtime speed but increases code size.

** Reader

** System Construction

** Environment

