manual.html

<div id="outline-container-orgf8619f3" class="outline-3">
<h3 id="orgf8619f3"><span class="section-number-3">3.12.</span> Conses</h3>
</div>

<div id="outline-container-org39ae6b2" class="outline-3">
<h3 id="org39ae6b2"><span class="section-number-3">3.13.</span> Arrays</h3>
<div class="outline-text-3" id="text-3-13">
<p>
In Clasp, arrays with no fill-pointer, displacement, or express adjustability are simple
(as in <code>simple-array</code>), and arrays that have any of these are not.
Additionally, Clasp implements multidimensional arrays - even ones that are simple in this sense - as
if they were displaced to an underlying one dimensional array.
As such, it is most efficient to work with one-dimensional simple arrays directly.
</p>
</div>
</div>

<div id="outline-container-org0ffaa93" class="outline-3">
<h3 id="org0ffaa93"><span class="section-number-3">3.14.</span> Strings</h3>
</div>

<div id="outline-container-orgc2fdf12" class="outline-3">
<h3 id="orgc2fdf12"><span class="section-number-3">3.15.</span> Sequences</h3>
<div class="outline-text-3" id="text-3-15">
</div>
<div id="outline-container-org2083348" class="outline-4">
<h4 id="org2083348"><span class="section-number-4">3.15.1.</span> Extensible Sequences</h4>
<div class="outline-text-4" id="text-3-15-1">
<p>
<a href="https://doi.org/10.1145/1622123.1622138">The extensible sequences protocol developed by Christophe Rhodes</a> is supported.
Symbols related to the protocol are external in Clasp's "SEQUENCE" package.
This protocol allows programmers to define their own sequence classes that work efficiently with standard
Common Lisp functions. It is recommended that programmers consult other resources,
such as Dr. Rhodes' paper, for more information on how to use this protocol effectively.
</p>

<p>
To summarize: Programmers wishing to make a custom sequence class must ensure their class has
<code>cl:sequence</code> as a superclass. (Note that <code>sequence</code> is itself abstract, so if a custom class needs to
have e.g. slots, it should also be a subclass of <code>standard-object</code> or something like it.)
Methods on <code>elt</code>, <code>(setf elt)</code>, <code>length</code> applicable to objects of the class must be defined for any
sequence functions to work; an applicable method on <code>make-sequence-like</code> must be defined for creation
of this sequence to work; and an applicable method on <code>adjust-sequence</code> must be defined for destructive
operations to work. Standard sequence functions will then operate correctly with these sequences,
as will <code>make-sequence</code> and <code>coerce</code>.
</p>

<p>
For efficiency, programmers may also define applicable methods on <code>make-sequence-iterator</code>,
or less efficiently but more simply, on <code>make-simple-sequence-iterator</code>, <code>iterator-step</code>, <code>iterator-endp</code>,
<code>iterator-element</code>, <code>(setf iterator-element)</code>, <code>iterator-index</code>, and <code>iterator-copy</code>.
</p>

<p>
Note that because the <code>sequence:</code> generic function cognates to <code>cl:</code> sequence functions are defined to
have the same behavior in almost all cases, Clasp takes the view that they need not be called.
For example, a call to <code>cl:find</code> with a custom sequence object <span class="underline">may</span> result in a call to <code>sequence:find</code>,
but may not. In other words the cognates are considered optional, and only possibly useful for
optimization. This is still in flux. If you think it's a bad idea, contact a maintainer to talk.
</p>

<p>
As a small extension to the extension, if a custom sequence object does not implement enough of the
protocol for a sequence function to complete, it will signal an error of type
<code>sequence:protocol-unimplemented</code>. The reader <code>sequence:protocol-unimplemented-operation</code> can be used to
get the name of the operation that failed from these conditions.
</p>
</div>
</div>
</div>

<div id="outline-container-org808c9e2" class="outline-3">
<h3 id="org808c9e2"><span class="section-number-3">3.16.</span> Hash Tables</h3>
<div class="outline-text-3" id="text-3-16">
<p>
<code>make-hash-table</code> supports additional keyword arguments.
</p>

<p>
<code>:weakness</code> can be used to indicate that the garbage collection may collect individual hash table entries
even when the hash table itself is live, in certain circumstances. At present, only weak-key hash tables
are supported: when the weakness argument is <code>:key</code>, the hash table's reference to the key of a table
entry is <span class="underline">weak</span>, and if there are no non-weak references to a key, it is collectable.
See the "Garbage Collection" section below for more information on weak references.
If the weakness parameter is passed as <code>nil</code>, or not passed, the hash table does not contain weak references.
</p>

<p>
<code>:thread-safe</code> can be used to make hash table access safe across multiple threads.
If a thread-safe argument is not passed, or <code>nil</code> is passed, the hash table cannot safely be written to
or read from multiple threads simultaneously (see "Memory Model", below, for a brief explanation of
terminology). If the thread-safe argument is true, the implementation will ensure that accesses can be
carried out from multiple threads simultaneously safely. This does impose a small performance penalty,
which is why it is not the default.
</p>

<p>
If a <code>:test</code> other than a standard equality predicate is passed, <code>:hash-function</code> must be specified as
well. The hash function should be a designator for a function of one argument that is analogous to
<code>sxhash</code>, i.e. <code>(funcall test x y)</code> implies <code>(</code> (funcall hash-function x) (funcall hash-function y))=
and so on. This will create a "custom" hash table that can be used with the standard hash table functions
like <code>gethash</code>, with the exception that at the moment, attempting to dump a custom hash table has
undefined consequences.
</p>
</div>
</div>

<div id="outline-container-org8cebe85" class="outline-3">
<h3 id="org8cebe85"><span class="section-number-3">3.17.</span> Filenames</h3>
</div>

<div id="outline-container-org8b2f91f" class="outline-3">
<h3 id="org8b2f91f"><span class="section-number-3">3.18.</span> Files</h3>
<div class="outline-text-3" id="text-3-18">
<p>
<code>ext:rmdir</code> deletes a directory. <code>EXT:RMTREE</code> deletes an entire directory tree.
</p>
</div>
</div>

<div id="outline-container-org26ac30a" class="outline-3">
<h3 id="org26ac30a"><span class="section-number-3">3.19.</span> Streams</h3>
<div class="outline-text-3" id="text-3-19">
</div>
<div id="outline-container-org1684136" class="outline-4">
<h4 id="org1684136"><span class="section-number-4">3.19.1.</span> Gray streams</h4>
<div class="outline-text-4" id="text-3-19-1">
<p>
The Gray stream interface as described in ANSI committee issue "STREAM-DEFINITION-BY-USER"
(readable, e.g., <a href="http://www.nhplace.com/kent/CL/Issues/stream-definition-by-user.html">on Kent Pitman's website</a>) is supported. Symbols are exported from package "GRAY".
We recommend programmers use a multi-implementation compatibility layer such as <a href="https://common-lisp.net/project/trivial-gray-streams/">trivial-gray-streams</a>
rather than use Clasp's implementation directly.
</p>

<p>
Gray streams allow programmers to define their own stream classes with custom behavior that work with
standard Common Lisp functions. It is recommended that programmers consult another resource, such as the
trivial-gray-streams documentation, for more information on how to use this interface effectively.
</p>
</div>
</div>
</div>

<div id="outline-container-orgba02f72" class="outline-3">
<h3 id="orgba02f72"><span class="section-number-3">3.20.</span> Printer</h3>
<div class="outline-text-3" id="text-3-20">
<p>
When <code>format</code>'s control string argument is constant, the compiler will process it early, so that the
runtime doesn't have to. This improves runtime speed but increases code size.
</p>
</div>
</div>

<div id="outline-container-org85f13e0" class="outline-3">
<h3 id="org85f13e0"><span class="section-number-3">3.21.</span> Reader</h3>
</div>

<div id="outline-container-org563ce55" class="outline-3">
<h3 id="org563ce55"><span class="section-number-3">3.22.</span> System Construction</h3>
</div>
