org/manual.org
*** Stepper

=cl:step= can be used to step through compiled code as partially described in the standard.
Currently, the stepper can only stop on forms that happen to be compiled as calls, though this may be
improved in the future.

Code is steppable if it is compiled with =debug 3= optimization settings, or is within the =step= macro.
While unsteppable code is being executed, the stepper will not stop.

Clasp further defines some aspects of stepping for the sake of editor/debugger integration.
When the stepper pauses execution, a condition of type =cl:step= is passed to the debugger.
This condition will print with the source form for the call.
Similarly to =cl:break=, =*debugger-hook*= is bound to =nil=, but =ext:*invoke-debugger-hook*=
(described below) can still be used for interception. The following restarts are available from a =step=
condition:

- =cl:continue=: Continue without stepping. The stepper will not invoke the debugger again.
- =clasp-debug:step-into=: Continue stepping. If the function to be called is steppable,
   the stepper will pause within it, and otherwise stepping will proceed after the call.
- =clasp-debug:step-over=: Continue stepping, but not into the call the stepper is on.
   Stepping will proceed after the call is exited (either by normal return or a non-local exit).

* C++ Interface (clbind)

[[file:clbind-doc.org][Documented here.]]

* Foreign Function Interface

Clasp can interact with C programs and libraries through its Foreign Function Interface (FFI).
Symbols relating to this interface are external in package "CLASP-FFI".
However, it is recommended for most applications that you use a cross-implementation wrapper layer,
specifically [[https://cffi.common-lisp.dev/][CFFI]]. Clasp's own interface has not yet been documented.

* REPL

Clasp's built in read-eval-print loop supports various commands in addition to evaluating Lisp forms.
These commands consist of lines beginning with a Lisp keyword, followed possibly by additional arguments.
The most up to date documentation for this interface is the on-line help system,
obtainable with the command =:help=.

Clasp has a built in debugger, which will be entered by =invoke-debugger= by default.
=:help= can describe the debugger commands as well. Some basic commands are =:b= to print a backtrace,
=:rN= to invoke the Nth restart, =:v= to print local variables in the frame, and =:up=, =:down=,
and =:go= for navigating frames.

In addition to the standard =*debugger-hook*=, Clasp has =ext:*invoke-debugger-hook*=.
This is a similar hook function, but it will be tried before =*debugger-hook*=, and importantly,
will be called even for =break= (which binds =*debugger-hook*= to =nil= per the standard).
This can be used to set up your own debugger in an IDE.

In the debugger, the function =ext:tpl-frame= can be used to return a representation of the current frame
suitable for the programmatic debug interface described below, and =ext:tpl-argument= and
=ext:tpl-arguments= can be used to retrieve arguments.

In some applications, it's useful for the program to exit rather than exit a debugger.
The functions =ext:disable-debugger= and =ext:enable-debugger= can be used to set whether the debugger
will be entered. These only affect the **built in** debugger, and they do not affect =*debugger-hook*=
or =ext:*invoke-debugger-hook*=.

* Debug interface

For advanced users, such as those developing development tools such as debuggers to use with Clasp,
a programmatic interface to debug information is provided by the =CLASP-DEBUG= package.

The =with-stack= and =call-with-stack= operators allow =frame= objects, representing part of the current
control stack, to be interrogated. These frame objects have several readers: =frame-function=,
=frame-arguments=, =frame-locals=, =frame-source-position=, and =frame-language=.
More specific information about the function can be obtained with =frame-function-name=,
=frame-function-lambda-list=, =frame-function-source-position=, =frame-function-form=,
=frame-function-documentation=, and =disassemble-frame=.

Note that frames necessarily have dynamic extent, because the local variables, arguments, and functions
they refer to may be dynamic-extent themselves.

To navigate frames smoothly, a notion of "visibility" exists. Frames can be "invisible" if they aren't of
interest to users. This includes things like internal system code. Of course, the concept of visiblity
can change. Frame visibility is controlled by the =*frame-filters*= variable, which holds a list of
function designators: a frame is visible if none of the functions return a true value when given the
frame as an argument. As such, all frames are considered visible if =*frame-filters*= is bound to =nil=.

=up= and =down= can be used to navigate visible frames, while =frame-up= and =frame-down= ignore
visibility. =map-stack=, =list-stack=, and =map-indexed-stack= can be used to perform manipulations on
all frames at once.

=with-truncated-stack= and =with-capped-stack= can be used as hints to =with-stack=
(and therefore debuggers) that only a portion of the control stack is of interest. For example, a
function that signals an error can use =with-truncated-stack= to ensure that lower debugger frames are
not included in backtraces.

=print-backtrace= is provided as a simple way to print a current backtrace, without needing to use
=with-stack= and the other more detailed operators.

* Multiprocessing

Multiprocessing is supported. Symbols relating to multiprocessing are exported from the "MP" package.
It is recommended that programmers use the [[https://github.com/sionescu/bordeaux-threads][Bordeaux-Threads]] compatibility library rather than Clasp's
interface directly when possible.

