manual.html

<div id="outline-container-org38f1fea" class="outline-3">
<h3 id="org38f1fea"><span class="section-number-3">3.23.</span> Environment</h3>
<div class="outline-text-3" id="text-3-23">
</div>
<div id="outline-container-orgc61246d" class="outline-4">
<h4 id="orgc61246d"><span class="section-number-4">3.23.1.</span> Stepper</h4>
<div class="outline-text-4" id="text-3-23-1">
<p>
<code>cl:step</code> can be used to step through compiled code as partially described in the standard.
Currently, the stepper can only stop on forms that happen to be compiled as calls, though this may be
improved in the future.
</p>

<p>
Code is steppable if it is compiled with <code>debug 3</code> optimization settings, or is within the <code>step</code> macro.
While unsteppable code is being executed, the stepper will not stop.
</p>

<p>
Clasp further defines some aspects of stepping for the sake of editor/debugger integration.
When the stepper pauses execution, a condition of type <code>cl:step</code> is passed to the debugger.
This condition will print with the source form for the call.
Similarly to <code>cl:break</code>, <code>*debugger-hook*</code> is bound to <code>nil</code>, but <code>ext:*invoke-debugger-hook*</code>
(described below) can still be used for interception. The following restarts are available from a <code>step</code>
condition:
</p>

<ul class="org-ul">
<li><code>cl:continue</code>: Continue without stepping. The stepper will not invoke the debugger again.</li>
<li><code>clasp-debug:step-into</code>: Continue stepping. If the function to be called is steppable,
the stepper will pause within it, and otherwise stepping will proceed after the call.</li>
<li><code>clasp-debug:step-over</code>: Continue stepping, but not into the call the stepper is on.
Stepping will proceed after the call is exited (either by normal return or a non-local exit).</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbc21741" class="outline-2">
<h2 id="orgbc21741"><span class="section-number-2">4.</span> C++ Interface (clbind)</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="clbind-doc.html">Documented here.</a>
</p>
</div>
</div>

<div id="outline-container-orga5b38bd" class="outline-2">
<h2 id="orga5b38bd"><span class="section-number-2">5.</span> Foreign Function Interface</h2>
<div class="outline-text-2" id="text-5">
<p>
Clasp can interact with C programs and libraries through its Foreign Function Interface (FFI).
Symbols relating to this interface are external in package "CLASP-FFI".
However, it is recommended for most applications that you use a cross-implementation wrapper layer,
specifically <a href="https://cffi.common-lisp.dev/">CFFI</a>. Clasp's own interface has not yet been documented.
</p>
</div>
</div>

<div id="outline-container-orgda813fc" class="outline-2">
<h2 id="orgda813fc"><span class="section-number-2">6.</span> REPL</h2>
<div class="outline-text-2" id="text-6">
<p>
Clasp's built in read-eval-print loop supports various commands in addition to evaluating Lisp forms.
These commands consist of lines beginning with a Lisp keyword, followed possibly by additional arguments.
The most up to date documentation for this interface is the on-line help system,
obtainable with the command <code>:help</code>.
</p>

<p>
Clasp has a built in debugger, which will be entered by <code>invoke-debugger</code> by default.
<code>:help</code> can describe the debugger commands as well. Some basic commands are <code>:b</code> to print a backtrace,
<code>:rN</code> to invoke the Nth restart, <code>:v</code> to print local variables in the frame, and <code>:up</code>, <code>:down</code>,
and <code>:go</code> for navigating frames.
</p>

<p>
In addition to the standard <code>*debugger-hook*</code>, Clasp has <code>ext:*invoke-debugger-hook*</code>.
This is a similar hook function, but it will be tried before <code>*debugger-hook*</code>, and importantly,
will be called even for <code>break</code> (which binds <code>*debugger-hook*</code> to <code>nil</code> per the standard).
This can be used to set up your own debugger in an IDE.
</p>

<p>
In the debugger, the function <code>ext:tpl-frame</code> can be used to return a representation of the current frame
suitable for the programmatic debug interface described below, and <code>ext:tpl-argument</code> and
<code>ext:tpl-arguments</code> can be used to retrieve arguments.
</p>

<p>
In some applications, it's useful for the program to exit rather than exit a debugger.
The functions <code>ext:disable-debugger</code> and <code>ext:enable-debugger</code> can be used to set whether the debugger
will be entered. These only affect the <b><b>built in</b></b> debugger, and they do not affect <code>*debugger-hook*</code>
or <code>ext:*invoke-debugger-hook*</code>.
</p>
</div>
</div>

<div id="outline-container-orge670187" class="outline-2">
<h2 id="orge670187"><span class="section-number-2">7.</span> Debug interface</h2>
<div class="outline-text-2" id="text-7">
<p>
For advanced users, such as those developing development tools such as debuggers to use with Clasp,
a programmatic interface to debug information is provided by the <code>CLASP-DEBUG</code> package.
</p>

<p>
The <code>with-stack</code> and <code>call-with-stack</code> operators allow <code>frame</code> objects, representing part of the current
control stack, to be interrogated. These frame objects have several readers: <code>frame-function</code>,
<code>frame-arguments</code>, <code>frame-locals</code>, <code>frame-source-position</code>, and <code>frame-language</code>.
More specific information about the function can be obtained with <code>frame-function-name</code>,
<code>frame-function-lambda-list</code>, <code>frame-function-source-position</code>, <code>frame-function-form</code>,
<code>frame-function-documentation</code>, and <code>disassemble-frame</code>.
</p>

<p>
Note that frames necessarily have dynamic extent, because the local variables, arguments, and functions
they refer to may be dynamic-extent themselves.
</p>

<p>
To navigate frames smoothly, a notion of "visibility" exists. Frames can be "invisible" if they aren't of
interest to users. This includes things like internal system code. Of course, the concept of visiblity
can change. Frame visibility is controlled by the <code>*frame-filters*</code> variable, which holds a list of
function designators: a frame is visible if none of the functions return a true value when given the
frame as an argument. As such, all frames are considered visible if <code>*frame-filters*</code> is bound to <code>nil</code>.
</p>

<p>
<code>up</code> and <code>down</code> can be used to navigate visible frames, while <code>frame-up</code> and <code>frame-down</code> ignore
visibility. <code>map-stack</code>, <code>list-stack</code>, and <code>map-indexed-stack</code> can be used to perform manipulations on
all frames at once.
</p>

<p>
<code>with-truncated-stack</code> and <code>with-capped-stack</code> can be used as hints to <code>with-stack</code>
(and therefore debuggers) that only a portion of the control stack is of interest. For example, a
function that signals an error can use <code>with-truncated-stack</code> to ensure that lower debugger frames are
not included in backtraces.
</p>

<p>
<code>print-backtrace</code> is provided as a simple way to print a current backtrace, without needing to use
<code>with-stack</code> and the other more detailed operators.
</p>
</div>
</div>

<div id="outline-container-org8b07d65" class="outline-2">
<h2 id="org8b07d65"><span class="section-number-2">8.</span> Multiprocessing</h2>
<div class="outline-text-2" id="text-8">
<p>
Multiprocessing is supported. Symbols relating to multiprocessing are exported from the "MP" package.
It is recommended that programmers use the <a href="https://github.com/sionescu/bordeaux-threads">Bordeaux-Threads</a> compatibility library rather than Clasp's
interface directly when possible.
</p>
</div>
