manual.html

<div id="outline-container-org3c00ed3" class="outline-3">
<h3 id="org3c00ed3"><span class="section-number-3">8.1.</span> Processes</h3>
<div class="outline-text-3" id="text-8-1">
<p>
A process is a Lisp object representing a distinct thread of execution. Each process evaluates a call to
a Lisp function, and exits when that call would finally return values. Processes have names for debugging
purposes. Processes are "nascent" or "not yet started" if they haven't yet begun evaluating, "active"
if they have begun evaluating, "suspended" if that evaluation has been paused by <code>process-suspend</code>,
and "exited" if they have finished evaluation (normally or by aborting).
</p>

<p>
Processes have type <code>process</code>. <code>make-process</code> creates a new process but does not start it.
<code>process-start</code> enables a process, and <code>process-run-function</code> both creates and enables a process.
The name of a process can be retrieved with <code>process-name</code>. <code>process-active-p</code> can be used to query
whether a process is active. <code>process-suspend</code>, <code>process-resume</code>, <code>interrupt-process</code>, and
<code>process-kill</code> interfere with a process's evaluation. <code>process-join</code> waits until a process until it
completes, and then returns the values its function returned, or signals an error of
type <code>process-join-error</code> if the process ended abnormally. Within a process, <code>exit-process</code> can be used
to end the process's evaluation immediately, and <code>abort-process</code> to do so abnormally; in either case the
dynamic environment is properly unwound. <code>all-processes</code> gets a list of all enabled processes.
The variable <code>*current-process*</code> is bound in any process to that process. Consult the docstrings of
these functions for more information.
</p>
</div>
</div>

<div id="outline-container-org70e328d" class="outline-3">
<h3 id="org70e328d"><span class="section-number-3">8.2.</span> Special variables</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Bindings of special variables (by <code>let</code>, <code>progv</code>, lambda lists, etc.) are thread-local.
That is, executing a binding form for a variable will not affect that variable's value in other threads.
The global value - from <code>symbol-value</code> - is, in contrast, shared between threads.
</p>
</div>
</div>

<div id="outline-container-org69b788b" class="outline-3">
<h3 id="org69b788b"><span class="section-number-3">8.3.</span> Mutexes</h3>
<div class="outline-text-3" id="text-8-3">
<p>
A mutex (short for "MUTual EXclusion"), or lock, can be used to control access to a shared resource by
multiple processes.
</p>

<p>
Mutexes have type <code>mutex</code>. A mutex is created with <code>make-lock</code>, or <code>make-recursive-mutex</code> for a recursive
mutex. <code>get-lock</code> and <code>giveup-lock</code> obtain and release exclusion on a mutex, respectively.
<code>mutex-name</code> retrieves any name of a mutex given at creation.
</p>
</div>
</div>

<div id="outline-container-org421abb5" class="outline-3">
<h3 id="org421abb5"><span class="section-number-3">8.4.</span> Shared Mutexes</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Not yet documented.
</p>
</div>
</div>

<div id="outline-container-org48cab55" class="outline-3">
<h3 id="org48cab55"><span class="section-number-3">8.5.</span> Condition Variables</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Not yet documented.
</p>
</div>
</div>

<div id="outline-container-org73a5092" class="outline-3">
<h3 id="org73a5092"><span class="section-number-3">8.6.</span> Memory Model</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Clasp does not have a formal memory model. Here is a sketch of one: Two accesses of a place are
<i>concurrent</i> if they take place in different threads and are not excluded from running simultaneously by
locks. Two concurrent accesses <i>conflict</i> if at least one is a write. If a conflicting access is
not <i>atomic</i> the program has undefined behavior (e.g. tearing).
</p>

<p>
Some accesses are atomic but <i>unordered</i>, meaning that there is not necessarily a modification order to
the place that is observed by all threads, e.g. one thread may see writes occur in a different order
from another thread. Some accesses are <i>sequentially consistent</i>, meaning that there is such a globally
observable modification order, and furthermore that all sequentially consistent accesses have a globally
observable order.
</p>

<p>
Places may be complex, indeed completely custom. Clasp defines atomicity of some simple places;
other places, and more complex modification operations, should hopefully be understandable from those.
For example, to setf the <code>second</code> of a list, one <code>cdr</code> must be read before a <code>car</code> is written, and each
of these individual accesses is atomic while the overall access is not.
</p>

<p>
In general Clasp tries to guarantee unordered atomicity, but does not always succeed, and in some cases
it's probably not possible.
</p>

<p>
Note that in this context "atomic" does not necessarily mean "lock-free", although Clasp attempts to make
atomic operations proceed without locks.
</p>

<p>
Places that can be accessed unorderedly are: <code>car</code>, <code>cdr</code>, <code>symbol-value</code>, <code>symbol-plist</code>,
<code>symbol-function=/=fdefinition</code>, <code>compiler-macro-function</code>, <code>ext:setf-expander</code>, <code>ext:type-expander</code>.
Access to the elements of simple one-dimensional arrays should be unordered, except for integer element
types smaller than <code>(unsigned-byte 8)</code>. Access to <code>standard-object</code> and <code>structure-object</code> slots
(of <code>:instance</code> or <code>:class</code> allocation) should also be unordered.
</p>
</div>
</div>

<div id="outline-container-org87b49c6" class="outline-3">
<h3 id="org87b49c6"><span class="section-number-3">8.7.</span> Atomics</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Access can be guaranteed atomic by using the <code>atomic</code> macro. That is, <code>(atomic place)</code> is a place that
can be accessed atomically, or else an error will be signaled. Clasp defines <code>car</code>, <code>cdr</code>, <code>first</code>,
<code>rest</code>, <code>symbol-value</code>, special variables, <code>symbol-plist</code>, <code>standard-instance-access</code>, <code>slot-value</code>,
<code>clos:slot-value-using-class</code>, and <code>svref</code> as atomically accessible, as well as <code>the</code> place or macro
places that expand to these places. Additional atomically accessible places can be defined with the
<code>define-atomic-expansion</code> macro. See its documentation string for more information. Additionally,
documentation on atomic access may be available with kind <code>atomic</code>; e.g.
try <code>(documentation 'symbol-value 'mp:atomic)</code>.
</p>
</div>
</div>

<div id="outline-container-orgea21694" class="outline-3">
<h3 id="orgea21694"><span class="section-number-3">8.8.</span> Compare-and-swap</h3>
<div class="outline-text-3" id="text-8-8">
<p>
The <code>mp:cas</code> macro can be used to execute an atomic compare-and-swap of atomically accessible places.
See its docstring for more information. <code>cas</code> is used to define higher order atomic read-modify-write
operations provided by Clasp: <code>atomic-update</code>, <code>atomic-incf</code>, <code>atomic-decf</code>, <code>atomic-push</code>, <code>atomic-pop</code>,
and <code>atomic-pushnew</code>. The first is a general operator analogous to what <code>define-modify-macro</code> operators
do, while the others are analogous to their standard versions. <code>-explicit</code> variants can be used to
explicitly specify the order of the operation.
</p>
</div>
</div>

<div id="outline-container-org7d1123e" class="outline-3">
<h3 id="org7d1123e"><span class="section-number-3">8.9.</span> Fences</h3>
<div class="outline-text-3" id="text-8-9">
<p>
The <code>mp:fence</code> function can be used to establish memory fences of a specified order.
</p>
</div>
</div>
</div>

<div id="outline-container-org6c1467a" class="outline-2">
<h2 id="org6c1467a"><span class="section-number-2">9.</span> Introspection</h2>
<div class="outline-text-2" id="text-9">
<p>
Information about objects is stored and accessible. This is primarily intended for editor integration,
but the functions can be used in any context. It is not recommended that they be used for purposes other
than human understanding, however - it can sometimes be dropped or inaccurate. These mechanisms are
similar to the standard <code>documentation</code> function.
</p>

<p>
<code>ext:function-lambda-list</code> can be used to get the lambda list of a function object, and
<code>ext:compiled-function-name</code> its name.
</p>

<p>
<code>ext:source-location</code> returns a list of source locations for a symbol or object. Source locations are of
type <code>ext:source-location</code>; they contain a pathname accessible with <code>ext:source-location-pathname</code>, and a
file offset (as from <code>file-position</code>) accessible with <code>ext:source-location-offset</code>.
</p>
</div>
</div>
