org/manual.org
* Sockets

A low level networking API based on [[http://sbcl.org/manual/index.html#Networking][SBCL's]] (which is in turn based on BSD sockets) is available in
package "SB-BSD-SOCKETS". Clasp's interface has not yet been specifically documented.

* Serve Event

Not yet documented.

* Garbage Collection

Symbols related to garbage collection are exported from the "GCTOOLS" package.

The function =garbage-collect= forces a garbage collection.

=finalize= registers a finalizer function for an object. When the object is collected, the function will
be called with no arguments. Note that this function should not close over the object, because then the
closure will keep that object alive indefinitely.

* POSIX

** Signal Handling

Handlers for standard POSIX signals can be defined in Clasp using the =ext:enable-interrupt= function,
which expects a keyword to identify the type of signal (e.g. =:sigpipe= for =SIGPIPE=).
If a Lisp function is used as the handler, it must be a function of one argument, the signal number.
=ext:enable-interrupt=, or =ext:ignore-interrupt= and =ext:default-interrupt=, can be used to set the
handler to the ignore-signal handler or the default handler respectively, analogous to =SIG_IGN= and
=SIG_DFL=. The current handler function, if there is one, can be retrieved with =ext:get-signal-handler=.

** Further posix interfaces

=ext:stat= and =ext:fstat= wrap the corresponding posix-interfaces. Use =ext:file-stream-file-descriptor=
to get the file-descriptor for a stream.
The environment can be accessed with =EXT:SETENV=and =EXT:GETENV=
Working directories can be accessed with =EXT:GETCWD=and =EXT:CHDIR=.  
