manual.html

<div id="outline-container-org0593e63" class="outline-2">
<h2 id="org0593e63"><span class="section-number-2">10.</span> Sockets</h2>
<div class="outline-text-2" id="text-10">
<p>
A low level networking API based on <a href="http://sbcl.org/manual/index.html#Networking">SBCL's</a> (which is in turn based on BSD sockets) is available in
package "SB-BSD-SOCKETS". Clasp's interface has not yet been specifically documented.
</p>
</div>
</div>

<div id="outline-container-orgdd77ef0" class="outline-2">
<h2 id="orgdd77ef0"><span class="section-number-2">11.</span> Serve Event</h2>
<div class="outline-text-2" id="text-11">
<p>
Not yet documented.
</p>
</div>
</div>

<div id="outline-container-orgab7bd5a" class="outline-2">
<h2 id="orgab7bd5a"><span class="section-number-2">12.</span> Garbage Collection</h2>
<div class="outline-text-2" id="text-12">
<p>
Symbols related to garbage collection are exported from the "GCTOOLS" package.
</p>

<p>
The function <code>garbage-collect</code> forces a garbage collection.
</p>

<p>
<code>finalize</code> registers a finalizer function for an object. When the object is collected, the function will
be called with no arguments. Note that this function should not close over the object, because then the
closure will keep that object alive indefinitely.
</p>
</div>
</div>

<div id="outline-container-orgf2544ea" class="outline-2">
<h2 id="orgf2544ea"><span class="section-number-2">13.</span> POSIX</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orga2d7c52" class="outline-3">
<h3 id="orga2d7c52"><span class="section-number-3">13.1.</span> Signal Handling</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Handlers for standard POSIX signals can be defined in Clasp using the <code>ext:enable-interrupt</code> function,
which expects a keyword to identify the type of signal (e.g. <code>:sigpipe</code> for <code>SIGPIPE</code>).
If a Lisp function is used as the handler, it must be a function of one argument, the signal number.
<code>ext:enable-interrupt</code>, or <code>ext:ignore-interrupt</code> and <code>ext:default-interrupt</code>, can be used to set the
handler to the ignore-signal handler or the default handler respectively, analogous to <code>SIG_IGN</code> and
<code>SIG_DFL</code>. The current handler function, if there is one, can be retrieved with <code>ext:get-signal-handler</code>.
</p>
</div>
</div>

<div id="outline-container-org851b419" class="outline-3">
<h3 id="org851b419"><span class="section-number-3">13.2.</span> Further posix interfaces</h3>
<div class="outline-text-3" id="text-13-2">
<p>
<code>ext:stat</code> and <code>ext:fstat</code> wrap the corresponding posix-interfaces. Use <code>ext:file-stream-file-descriptor</code>
to get the file-descriptor for a stream.
The environment can be accessed with <code>EXT:SETENV=and =EXT:GETENV</code>
Working directories can be accessed with <code>EXT:GETCWD=and =EXT:CHDIR</code>.  
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<center><p>
<a href="sitemap.html">Sitemap</a> &#x2014; <a href="license.html">License</a>
</p>
</center>
</div>
</body>
</html>
